manual/devel-man.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Developer's Manual</title>
<!-- 2013-08-23 Fri 11:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
</head>
<body>
<div id="content">
<h1 class="title">Developer's Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Adding a Proposal</a></li>
<li><a href="#sec-2">2. Build Process Caveats</a></li>
<li><a href="#sec-3">3. Good git practices</a>
<ul>
<li><a href="#sec-3-1">3.1. Branches are Always Underused</a></li>
<li><a href="#sec-3-2">3.2. detached HEAD</a></li>
<li><a href="#sec-3-3">3.3. resetting your working copy</a></li>
<li><a href="#sec-3-4">3.4. quickly saving your modifications for later without commiting</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Adding a Proposal</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>add a file called Proposal.cpp and Proposal.hpp to the folder proposals (maybe just copy the template)
</li>
<li>refresh the sources for the Makefile as follows:
<div class="org-src-container">

<pre class="src src-bash">$ make my-update-src
</pre>
</div>
</li>
<li>implement (specifically the purely virtual methods)
</li>
<li>add an id for your proposal to ProposalType.hpp
</li>
<li>initialize your proposal in ProposalRegistry.hpp (don't forget the header file)
</li>
<li>to add your proposal to the default startup, add your proposal id to 
<div class="org-src-container">

<pre class="src src-c">std::vector&lt;ProposalType&gt; getProposalsForCategory(Category c)
</pre>
</div>
</li>
<li>add the a string representation for the config file in the
function below. Your proposal can now be enabled from the config
file, but will not show up by default (that's what you
need 6. for)
<div class="org-src-container">

<pre class="src src-c">std::string getConfigStringFromType(ProposalType p )
</pre>
</div>
</li>
<li>in ProposalType.cpp: add your proposal to getSingleParameterProposalsForCategory
</li>
<li>in ProposalType.cpp: by adding your proposal to you can control,
whether using the proposal is suppressed. By default new
proposals are only instantiated, if this function returns true
for the respective proposal.
</li>
<li>when you call exabayes now, your proposal can be
instantiated. You have to add your proposal to a few additional
places. The easiest thing is to just call the program and check,
where assertions fail.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Build Process Caveats</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>on some of our group servers the clock is not set properly. If
the build system complains about times, simply touch everything
until it works 
<div class="org-src-container">

<pre class="src src-bash">$ touch $(find . )
</pre>
</div>
</li>
<li>out-dated dependencies can mess up the build process, thus:      
<div class="org-src-container">

<pre class="src src-bash">$ rm -rf .deps
</pre>
</div>
</li>
<li>the defaultRun.sh script will save the last configure call into
the file status. If you aborted the configure process or somehow
the whole process got stuck, it is a good idea to delete the
status file and thus enforce a new configure
</li>
<li>exabayes should work with &gt;gcc-4.6 or &gt;clang-3.2
</li>
<li>for a build with the ExaML code base, defaultRun.sh needs mpich2
</li>
<li>If you want to install ExaBayes on another machine, where you
have less administrative capabilities, it is a good idea, to
create a tar-ball with
This tar-ball should be definitely configure-able, it must be
independent from autoconf/automake system. 
<div class="org-src-container">

<pre class="src src-bash">$ make dist
</pre>
</div>
</li>
<li>you may create a distinct build directory like this:
<div class="org-src-container">

<pre class="src src-bash">$ mkdir build 
$ cd build 
$ ../configure &amp;&amp; make
</pre>
</div>
</li>
<li>if autosave-files have been created that contain #, this may mess
up the source-refreshing process. Check out (and repair) the file
that contains all sources (src.am) 
</li>
<li>occasionally you may encounter weird error messages after linking
that indicate that the various functions could not be found. If
you can rule out other sources of error (e.g., you did not
implement the method), then one of the earlier linking steps
could have gone wrong.
</li>
<li>install ccache. It will speed up re-compiling. defaultRun.sh
knows how to handle it. ccache should never influence the
compilation result. However, if something like in (9.)  has gone
wrong, ccache will cache it. You should delete the cache then  
<div class="org-src-container">

<pre class="src src-bash">$ ccache -C
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Good git practices</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Branches are Always Underused</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A good workflow is something like this:      
</p>
<ol class="org-ol">
<li>create a branch for implementing a new feature or trying
something out (you should be on branch master to do so):
<div class="org-src-container">

<pre class="src src-bash">$ git checkout -b newFeature # create new branch
</pre>
</div>
</li>
<li>implement the feature. Commit often, such that it is easy to
reset, if something went wrong.
</li>
<li>Merge your feature into the master. You can squash all your
commits into one message.
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash">$ git checkout master 
$ git merge --squash
$ git commit -a -m "This is my new feature..."
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> detached HEAD</h3>
<div class="outline-text-3" id="text-3-2">
<p>
If you checked out a specific commit, it may be confusing how to
get back to the original branch. That's actually just:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ git checkout master # or any other branch 
$ # or
$ git reset --hard master
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> resetting your working copy</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-bash">$ git reset --hard
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> quickly saving your modifications for later without commiting</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-bash">$ git stash 
$ git stash pop # restore
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2013-08-23 Fri 11:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
